tutorials/lagrangian/reactingParcelFoam/filter/0.orig/H2O
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      H2O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            zeroGradient;
    }
    cycLeft_half0
    {
        type            cyclic;
    }
    cycRight_half0
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
    cycLeft_half1
    {
        type            cyclic;
    }
    cycRight_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
